apilogs.txt

<?xml version = "1.0" encoding = "UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:ns2="http://oracle.e1.bssv.JP420000/"><env:Header><ns1:Security><ns1:UsernameToken><ns1:Username>WPSTORES</ns1:Username><ns1:Password>tracyripon</ns1:Password></ns1:UsernameToken></ns1:Security></env:Header>   <env:Body>
    <ns2:processSalesOrderV4>
    <header>
    <businessUnit>17</businessUnit>
    <customerPO>1</customerPO>
        <detail>
            <businessUnit>03</businessUnit>
            <processing>
                <actionType>A</actionType>
            </processing>
            <product>
                <item>
            <itemProduct>P13050-02</itemProduct>
                </item>
            </product>
            <quantityOrdered>3</quantityOrdered>
            <unitOfMeasureCodeTransaction>EA</unitOfMeasureCodeTransaction>
            <reference>62433</reference>
        </detail><orderTakenBy>WEBSAMPLE</orderTakenBy>
    <orderedBy>Gabriel  V</orderedBy>
    <processing>
        <actionType>A</actionType>
        <processingVersion>TWG420023</processingVersion>
    </processing>
    <attachmentText>Hello - Can you please ship these for 2 Day delivery? I would like them to arrive by end of day on the 15th.</attachmentText>
    <dateRequested>2024-05-17T00:00:00</dateRequested>
    <shipTo>
        <mailingName>Gabriel Valle</mailingName>
        <addressLine1>1000 Darden Center Dr</addressLine1>
        <addressLine2></addressLine2>
        <addressLine4>4076949567</addressLine4>
        <city>Orlando</city>
        <countryCode>US</countryCode>
        <countyCode>US</countyCode>
        <customer>
            <entityId>512443</entityId>
        </customer>
        <postalCode>32837</postalCode>
        <stateCode>FL</stateCode>
    </shipTo><soldTo>
        <mailingName>Gabriel Valle</mailingName>
        <addressLine1>1000 Darden Center Dr</addressLine1>
        <addressLine2></addressLine2>
        <addressLine4>4076949567</addressLine4>
        <city>Orlando</city>
        <countryCode>US</countryCode>
        <countyCode>US</countyCode>
        <customer>
            <entityId>510674</entityId>
        </customer>
        <postalCode>32837</postalCode>
        <stateCode>FL</stateCode>
    </soldTo ></header>
    </ns2:processSalesOrderV4>
    </env:Body></env:Envelope>
==============
